// Задайте строку, содержащую латинские буквы в обоих регистрах. Сформируйте строку, в которой все заглавные буквы заменены на строчные.


string str = "AjjrfgFhjrbfY!";
Console.WriteLine(str);
Console.WriteLine(str.ToLower());